eksempel/testxml/iti18-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<Action soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQuery</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:f99a462d-4a28-426d-a950-d2fc953720b8</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://sdsxdsudv.kvalitetsit.dk:8443/registry/services/xds-iti18</To>
		<ReplyTo soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
	</soap:Header>
	<soap:Body>
		<ns4:AdhocQueryRequest xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
			xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
			xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
			<ns4:ResponseOption returnType="LeafClass"
				returnComposedObjects="true" />
			<ns2:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<ns2:Slot name="$XDSDocumentEntryTypeCode">
					<ns2:ValueList>
						<ns2:Value>('39289-4^^2.16.840.1.113883.6.1')</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryPatientId">
					<ns2:ValueList>
						<ns2:Value>'2512489996^^^&amp;1.2.208.176.1.2&amp;ISO'</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryStatus">
					<ns2:ValueList>
						<ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
			</ns2:AdhocQuery>
		</ns4:AdhocQueryRequest>
	</soap:Body>
</soap:Envelope>
